In [2]:
import pandas as pd
import datetime as dt

In [3]:
birthday = dt.date(1991, 4, 12)

birthday = dt.date(year=1991, month=4, day=12)

birthday

datetime.date(1991, 4, 12)

In [4]:
birthday.year, birthday.month, birthday.day

(1991, 4, 12)

In [5]:
alarm_clock = dt.time(6, 43, 25)

alarm_clock = dt.time(hour=6, minute=43, second=25)

alarm_clock

datetime.time(6, 43, 25)

In [6]:
moon_landing = dt.datetime(1969, 7, 20, 22, 56, 20)
moon_landing = dt.datetime(
    year = 1969,
    month = 7,
    day = 20,
    hour = 22,
    minute = 56,
    second = 20
)
moon_landing

datetime.datetime(1969, 7, 20, 22, 56, 20)

In [7]:
dt.datetime(2020, 1, 1)

datetime.datetime(2020, 1, 1, 0, 0)

In [8]:
dt.timedelta(
    weeks=8,
    days=6,
    hours=3,
    minutes=58,
    seconds=12,
)

datetime.timedelta(days=62, seconds=14292)

In [9]:
pd.Timestamp(1991, 4, 12)

Timestamp('1991-04-12 00:00:00')

In [10]:
pd.Timestamp(year=1991, month=4, day=12)

Timestamp('1991-04-12 00:00:00')

In [11]:
pd.Timestamp(year=1991, month=4, day=12, hour=7) == dt.datetime(year=1991, month=4, day=12, hour=7)

True

In [12]:
pd.Timestamp("2015-03-31")

Timestamp('2015-03-31 00:00:00')

In [13]:
pd.Timestamp("2015-3-31")

Timestamp('2015-03-31 00:00:00')

In [14]:
pd.Timestamp("2015/3/31")

Timestamp('2015-03-31 00:00:00')

In [15]:
pd.Timestamp("03/31/2025")

Timestamp('2025-03-31 00:00:00')

In [16]:
pd.Timestamp("03/31/2025 09:30:15")

Timestamp('2025-03-31 09:30:15')

In [17]:
pd.Timestamp("03/31/2025 09:30:15 PM")

Timestamp('2025-03-31 21:30:15')

In [18]:
pd.Timestamp("03/31/2025 18:30:15")

Timestamp('2025-03-31 18:30:15')

In [19]:
my_time = pd.Timestamp(dt.datetime(2025, 2, 3, 21, 35, 22))

my_time

Timestamp('2025-02-03 21:35:22')

In [20]:
my_time.year, my_time.hour, my_time.second

(2025, 21, 22)

In [21]:
pd.Series([1, 2, 3, 4, 10]).index

RangeIndex(start=0, stop=5, step=1)

In [22]:
pd.Series([1, 2, 3], index=["A", "B", "C"]).index

Index(['A', 'B', 'C'], dtype='object')

In [23]:
timestamps = [
    pd.Timestamp("2020-01-01"),
    pd.Timestamp("2020-02-01"),
    pd.Timestamp("2020-03-01"),
]

pd.Series([1, 2, 3], index=timestamps)

2020-01-01    1
2020-02-01    2
2020-03-01    3
dtype: int64

In [24]:
pd.Series([1, 2, 3], index=timestamps).index

DatetimeIndex(['2020-01-01', '2020-02-01', '2020-03-01'], dtype='datetime64[ns]', freq=None)

In [25]:
many_dates = [
    dt.datetime(2020, 1, 1),
    dt.datetime(2020, 2, 1),
    dt.datetime(2020, 3, 1),
]

pd.Series([1, 2, 3], index=many_dates)

2020-01-01    1
2020-02-01    2
2020-03-01    3
dtype: int64

In [26]:
pd.Series([1, 2, 3], index=many_dates).index

DatetimeIndex(['2020-01-01', '2020-02-01', '2020-03-01'], dtype='datetime64[ns]', freq=None)

In [27]:
string_dates = ["2018/01/02", "2016/04/12", "2009/09/07"]

pd.DatetimeIndex(data=string_dates)

DatetimeIndex(['2018-01-02', '2016-04-12', '2009-09-07'], dtype='datetime64[ns]', freq=None)

In [28]:
mixed_dates = [
    dt.date(2018, 1, 2),
    "2016/04/12",
    pd.Timestamp(2009, 9, 7)
]

dt_index = pd.DatetimeIndex(data=mixed_dates)
dt_index

DatetimeIndex(['2018-01-02', '2016-04-12', '2009-09-07'], dtype='datetime64[ns]', freq=None)

In [29]:
s = pd.Series([100, 200, 300], index=dt_index)

s

2018-01-02    100
2016-04-12    200
2009-09-07    300
dtype: int64

In [30]:
s.sort_index(ascending=True)

2009-09-07    300
2016-04-12    200
2018-01-02    100
dtype: int64

In [32]:
morning = pd.Timestamp("2020-01-01 11:23:22 AM")
evening = pd.Timestamp("2020-01-01 11:23:22 PM")

morning < evening

True

In [36]:
disney = pd.read_csv("datasets/disney.csv", parse_dates=["Date"])

disney

            Date        High         Low        Open       Close
0     1962-01-02    0.096026    0.092908    0.092908    0.092908
1     1962-01-03    0.094467    0.092908    0.092908    0.094155
2     1962-01-04    0.094467    0.093532    0.094155    0.094155
3     1962-01-05    0.094779    0.093844    0.094155    0.094467
4     1962-01-08    0.095714    0.092285    0.094467    0.094155
...          ...         ...         ...         ...         ...
14722 2020-06-26  111.199997  108.019997  110.949997  109.099998
14723 2020-06-29  111.570000  108.099998  109.000000  111.519997
14724 2020-06-30  112.050003  109.930000  111.500000  111.510002
14725 2020-07-01  115.599998  112.290001  112.820000  113.010002
14726 2020-07-02  115.099998  112.000000  115.000000  112.180000

[14727 rows x 5 columns]

In [37]:
disney.dtypes

Date     datetime64[ns]
High            float64
Low             float64
Open            float64
Close           float64
dtype: object

In [38]:
disney.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14727 entries, 0 to 14726
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    14727 non-null  datetime64[ns]
 1   High    14727 non-null  float64
 2   Low     14727 non-null  float64
 3   Open    14727 non-null  float64
 4   Close   14727 non-null  float64
dtypes: datetime64[ns](1), float64(4)
memory usage: 575.4 KB

In [42]:
string_dates = ["2015-01-01", "2016-2-2", "2017-03-03"]

dt_index = pd.to_datetime(string_dates)

dt_index

DatetimeIndex(['2015-01-01', '2016-02-02', '2017-03-03'], dtype='datetime64[ns]', freq=None)

In [43]:
pd.to_datetime(disney["Date"]).head()

0   1962-01-02
1   1962-01-03
2   1962-01-04
3   1962-01-05
4   1962-01-08
Name: Date, dtype: datetime64[ns]

In [44]:
disney.dtypes

Date     datetime64[ns]
High            float64
Low             float64
Open            float64
Close           float64
dtype: object

In [46]:
disney["Date"].dt

In [48]:
disney["Date"].head()

0   1962-01-02
1   1962-01-03
2   1962-01-04
3   1962-01-05
4   1962-01-08
Name: Date, dtype: datetime64[ns]

In [52]:
disney["Date"].dt.day.head()

0    2
1    3
2    4
3    5
4    8
Name: Date, dtype: int32

In [53]:
disney["Date"].dt.month.head()

0    1
1    1
2    1
3    1
4    1
Name: Date, dtype: int32

In [54]:
disney["Date"].dt.year.head()

0    1962
1    1962
2    1962
3    1962
4    1962
Name: Date, dtype: int32

In [55]:
disney["Date"].dt.dayofweek.head()

0    1
1    2
2    3
3    4
4    0
Name: Date, dtype: int32

In [56]:
disney["Date"].dt.day_name().head()

0      Tuesday
1    Wednesday
2     Thursday
3       Friday
4       Monday
Name: Date, dtype: object

In [57]:
disney

            Date        High         Low        Open       Close
0     1962-01-02    0.096026    0.092908    0.092908    0.092908
1     1962-01-03    0.094467    0.092908    0.092908    0.094155
2     1962-01-04    0.094467    0.093532    0.094155    0.094155
3     1962-01-05    0.094779    0.093844    0.094155    0.094467
4     1962-01-08    0.095714    0.092285    0.094467    0.094155
...          ...         ...         ...         ...         ...
14722 2020-06-26  111.199997  108.019997  110.949997  109.099998
14723 2020-06-29  111.570000  108.099998  109.000000  111.519997
14724 2020-06-30  112.050003  109.930000  111.500000  111.510002
14725 2020-07-01  115.599998  112.290001  112.820000  113.010002
14726 2020-07-02  115.099998  112.000000  115.000000  112.180000

[14727 rows x 5 columns]

In [58]:
disney["Day of Week"] = disney["Date"].dt.day_name()

In [59]:
disney

            Date        High         Low        Open       Close Day of Week
0     1962-01-02    0.096026    0.092908    0.092908    0.092908     Tuesday
1     1962-01-03    0.094467    0.092908    0.092908    0.094155   Wednesday
2     1962-01-04    0.094467    0.093532    0.094155    0.094155    Thursday
3     1962-01-05    0.094779    0.093844    0.094155    0.094467      Friday
4     1962-01-08    0.095714    0.092285    0.094467    0.094155      Monday
...          ...         ...         ...         ...         ...         ...
14722 2020-06-26  111.199997  108.019997  110.949997  109.099998      Friday
14723 2020-06-29  111.570000  108.099998  109.000000  111.519997      Monday
14724 2020-06-30  112.050003  109.930000  111.500000  111.510002     Tuesday
14725 2020-07-01  115.599998  112.290001  112.820000  113.010002   Wednesday
14726 2020-07-02  115.099998  112.000000  115.000000  112.180000    Thursday

[14727 rows x 6 columns]

In [61]:
group_disney = disney.groupby("Day of Week")

group_disney.mean()

,Date,High,Low,Open,Close
Day of Week,,,,,
Friday,1991-04-22 07:43:12.391304320,23.767304,23.318898,23.552872,23.554498
Monday,1991-01-07 17:19:32.688477952,23.377271,22.930606,23.161392,23.162543
Thursday,1991-04-18 19:51:05.226198528,23.770234,23.288687,23.534561,23.540359
Tuesday,1991-04-28 15:55:03.487213568,23.791234,23.335267,23.571755,23.562907
Wednesday,1991-06-05 20:20:29.619746432,23.842743,23.355419,23.605618,23.609873

In [63]:
group_disney.sum(numeric_only=True)

                     High           Low          Open         Close
Day of Week
Friday       69970.942286  68650.835842  69339.655857  69344.443530
Monday       65736.884907  64480.864975  65129.833076  65133.070752
Thursday     70407.433233  68981.090582  69709.370574  69726.542101
Tuesday      71635.406149  70262.488195  70974.554769  70947.914266
Wednesday    71480.544662  70019.547501  70769.643422  70782.400077

In [64]:
disney["Date"].dt.month_name()

0        January
1        January
2        January
3        January
4        January
          ...
14722       June
14723       June
14724       June
14725       July
14726       July
Name: Date, Length: 14727, dtype: object

In [65]:
disney["Date"].dt.is_quarter_start

0        False
1        False
2        False
3        False
4        False
         ...
14722    False
14723    False
14724    False
14725     True
14726    False
Name: Date, Length: 14727, dtype: bool

In [66]:
disney[disney["Date"].dt.is_quarter_start].head()

          Date      High       Low      Open     Close Day of Week
189 1962-10-01  0.064849  0.062355  0.063913  0.062355      Monday
314 1963-04-01  0.087989  0.086704  0.087025  0.086704      Monday
377 1963-07-01  0.096338  0.095053  0.096338  0.095696      Monday
441 1963-10-01  0.110467  0.107898  0.107898  0.110467     Tuesday
565 1964-04-01  0.116248  0.112394  0.112394  0.116248   Wednesday

In [67]:
disney[disney["Date"].dt.is_quarter_end].head()

          Date      High       Low      Open     Close Day of Week
251 1962-12-31  0.074501  0.071290  0.074501  0.072253      Monday
440 1963-09-30  0.109825  0.105972  0.108541  0.107577      Monday
502 1963-12-31  0.101476  0.096980  0.097622  0.101476     Tuesday
564 1964-03-31  0.115605  0.112394  0.114963  0.112394     Tuesday
628 1964-06-30  0.101476  0.100191  0.101476  0.100834     Tuesday

In [68]:
disney[disney["Date"].dt.is_month_start].head()

          Date      High       Low      Open     Close Day of Week
22  1962-02-01  0.096338  0.093532  0.093532  0.094779    Thursday
41  1962-03-01  0.095714  0.093532  0.093532  0.095714    Thursday
83  1962-05-01  0.087296  0.085426  0.085738  0.086673     Tuesday
105 1962-06-01  0.079814  0.077943  0.079814  0.079814      Friday
147 1962-08-01  0.068590  0.068278  0.068590  0.068590   Wednesday

In [69]:
disney[disney["Date"].dt.is_month_end].head()

          Date      High       Low      Open     Close Day of Week
21  1962-01-31  0.093844  0.092908  0.093532  0.093532   Wednesday
40  1962-02-28  0.094779  0.093220  0.094155  0.093220   Wednesday
82  1962-04-30  0.087608  0.085738  0.087608  0.085738      Monday
104 1962-05-31  0.082308  0.079814  0.079814  0.079814    Thursday
146 1962-07-31  0.069214  0.068278  0.068278  0.068590     Tuesday

In [70]:
disney[disney["Date"].dt.is_year_end].head()

           Date      High       Low      Open     Close Day of Week
251  1962-12-31  0.074501  0.071290  0.074501  0.072253      Monday
502  1963-12-31  0.101476  0.096980  0.097622  0.101476     Tuesday
755  1964-12-31  0.117853  0.116890  0.116890  0.116890    Thursday
1007 1965-12-31  0.154141  0.150929  0.153498  0.152214      Friday
1736 1968-12-31  0.439301  0.431594  0.434163  0.436732     Tuesday

In [71]:
disney[disney["Date"].dt.is_year_start].head()

Empty DataFrame
Columns: [Date, High, Low, Open, Close, Day of Week]
Index: []

In [72]:
pd.DateOffset(years=3, months=4, days=5)

In [73]:
disney["Date"].head()

0   1962-01-02
1   1962-01-03
2   1962-01-04
3   1962-01-05
4   1962-01-08
Name: Date, dtype: datetime64[ns]

In [75]:
disney["Date"] + pd.DateOffset(days=5)

0       1962-01-07
1       1962-01-08
2       1962-01-09
3       1962-01-10
4       1962-01-13
           ...
14722   2020-07-01
14723   2020-07-04
14724   2020-07-05
14725   2020-07-06
14726   2020-07-07
Name: Date, Length: 14727, dtype: datetime64[ns]

In [76]:
disney["Date"] - pd.DateOffset(days=3)

0       1961-12-30
1       1961-12-31
2       1962-01-01
3       1962-01-02
4       1962-01-05
           ...
14722   2020-06-23
14723   2020-06-26
14724   2020-06-27
14725   2020-06-28
14726   2020-06-29
Name: Date, Length: 14727, dtype: datetime64[ns]

In [77]:
(disney["Date"] + pd.DateOffset(days=5, hours=6)).head()

0   1962-01-07 06:00:00
1   1962-01-08 06:00:00
2   1962-01-09 06:00:00
3   1962-01-10 06:00:00
4   1962-01-13 06:00:00
Name: Date, dtype: datetime64[ns]

In [78]:
(disney["Date"] - pd.DateOffset(months=3, days=5, hours=6, minutes=3)).head()

0   1961-09-26 17:57:00
1   1961-09-27 17:57:00
2   1961-09-28 17:57:00
3   1961-09-29 17:57:00
4   1961-10-02 17:57:00
Name: Date, dtype: datetime64[ns]

In [79]:
disney["Date"].tail()

14722   2020-06-26
14723   2020-06-29
14724   2020-06-30
14725   2020-07-01
14726   2020-07-02
Name: Date, dtype: datetime64[ns]

In [80]:
(disney["Date"] + pd.offsets.MonthEnd()).tail()

14722   2020-06-30
14723   2020-06-30
14724   2020-07-31
14725   2020-07-31
14726   2020-07-31
Name: Date, dtype: datetime64[ns]

In [81]:
duration = pd.Timedelta(
    days = 8,
    hours = 7,
    minutes = 6,
    seconds = 5
)

duration

Timedelta('8 days 07:06:05')

In [82]:
pd.to_timedelta("3 hours, 5 minutes, 12 seconds")

Timedelta('0 days 03:05:12')

In [83]:
pd.to_timedelta(5, unit="hour")

Timedelta('0 days 05:00:00')

In [84]:
pd.to_timedelta([5, 10, 15], unit="day")

TimedeltaIndex(['5 days', '10 days', '15 days'], dtype='timedelta64[ns]', freq=None)

In [85]:
pd.Timestamp("1999-02-05") - pd.Timestamp("1998-05-24")

Timedelta('257 days 00:00:00')

In [88]:
td = pd.Timestamp("2025-04-14") - pd.Timestamp("1990-09-11")

td

Timedelta('12634 days 00:00:00')

In [89]:
td.days

12634

In [91]:
td.isoformat()

'P12634DT0H0M0S'

In [98]:
deliveries = pd.read_csv("datasets/deliveries.csv")

deliveries.head()

  order_date delivery_date
0    5/24/98        2/5/99
1    4/22/92        3/6/98
2    2/10/91       8/26/92
3    7/21/92      11/20/97
4     9/2/93       6/10/98

In [99]:
deliveries.dtypes

order_date       object
delivery_date    object
dtype: object

In [101]:
for column in ["order_date", "delivery_date"]:
    deliveries[column] = pd.to_datetime(deliveries[column], format="%m/%d/%Y")

In [103]:
deliveries.head()

  order_date delivery_date
0 1998-05-24    1999-02-05
1 1992-04-22    1998-03-06
2 1991-02-10    1992-08-26
3 1992-07-21    1997-11-20
4 1993-09-02    1998-06-10

In [104]:
deliveries.dtypes

order_date       datetime64[ns]
delivery_date    datetime64[ns]
dtype: object

In [105]:
(deliveries["delivery_date"] - deliveries["order_date"]).head()

0    257 days
1   2144 days
2    563 days
3   1948 days
4   1742 days
dtype: timedelta64[ns]

In [106]:
deliveries["duration"] = deliveries["delivery_date"] - deliveries["order_date"]

In [107]:
deliveries

    order_date delivery_date  duration
0   1998-05-24    1999-02-05  257 days
1   1992-04-22    1998-03-06 2144 days
2   1991-02-10    1992-08-26  563 days
3   1992-07-21    1997-11-20 1948 days
4   1993-09-02    1998-06-10 1742 days
..         ...           ...       ...
496 1991-06-24    1996-02-02 1684 days
497 1991-09-09    1998-03-30 2394 days
498 1990-11-16    1998-04-27 2719 days
499 1993-06-03    1993-06-13   10 days
500 1990-01-04    1991-10-03  637 days

[501 rows x 3 columns]

In [108]:
deliveries.dtypes

order_date        datetime64[ns]
delivery_date     datetime64[ns]
duration         timedelta64[ns]
dtype: object

In [109]:
(deliveries["delivery_date"] - deliveries["duration"]).head()

0   1998-05-24
1   1992-04-22
2   1991-02-10
3   1992-07-21
4   1993-09-02
dtype: datetime64[ns]

In [110]:
deliveries.sort_values(by="duration")

    order_date delivery_date  duration
454 1990-05-24    1990-06-01    8 days
294 1994-08-11    1994-08-20    9 days
10  1998-05-10    1998-05-19    9 days
499 1993-06-03    1993-06-13   10 days
143 1997-09-20    1997-10-06   16 days
..         ...           ...       ...
152 1990-09-18    1999-12-19 3379 days
62  1990-04-02    1999-08-16 3423 days
458 1990-02-13    1999-11-15 3562 days
145 1990-03-07    1999-12-25 3580 days
448 1990-01-20    1999-11-12 3583 days

[501 rows x 3 columns]

In [111]:
deliveries["duration"].max()

Timedelta('3583 days 00:00:00')

In [112]:
deliveries["duration"].min()

Timedelta('8 days 00:00:00')

In [113]:
deliveries["duration"].mean()

Timedelta('1217 days 22:53:53.532934128')

In [114]:
deliveries["duration"] > pd.Timedelta(days=365)

0      False
1       True
2       True
3       True
4       True
       ...
496     True
497     True
498     True
499    False
500     True
Name: duration, Length: 501, dtype: bool

In [116]:
deliveries[deliveries["duration"] > pd.Timedelta(days=365)].head()

  order_date delivery_date  duration
1 1992-04-22    1998-03-06 2144 days
2 1991-02-10    1992-08-26  563 days
3 1992-07-21    1997-11-20 1948 days
4 1993-09-02    1998-06-10 1742 days
6 1990-01-25    1994-10-02 1711 days

In [121]:
deliveries[deliveries["duration"] > pd.Timedelta(days=3200, hours=8, minutes=4)]

    order_date delivery_date  duration
62  1990-04-02    1999-08-16 3423 days
145 1990-03-07    1999-12-25 3580 days
152 1990-09-18    1999-12-19 3379 days
164 1990-02-27    1999-01-04 3233 days
187 1990-12-24    1999-12-04 3267 days
333 1990-03-16    1998-12-28 3209 days
379 1990-09-19    1999-09-16 3284 days
448 1990-01-20    1999-11-12 3583 days
458 1990-02-13    1999-11-15 3562 days
477 1991-01-30    1999-12-02 3228 days

In [123]:
citi_bike = pd.read_csv("datasets/citibike.csv")

citi_bike.head()

                 start_time                 stop_time
0  2020-06-01 00:00:03.3720  2020-06-01 00:17:46.2080
1  2020-06-01 00:00:03.5530  2020-06-01 01:03:33.9360
2  2020-06-01 00:00:09.6140  2020-06-01 00:17:06.8330
3  2020-06-01 00:00:12.1780  2020-06-01 00:03:58.8640
4  2020-06-01 00:00:21.2550  2020-06-01 00:24:18.9650

In [124]:
citi_bike.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1882273 entries, 0 to 1882272
Data columns (total 2 columns):
 #   Column      Dtype
---  ------      -----
 0   start_time  object
 1   stop_time   object
dtypes: object(2)
memory usage: 28.7+ MB

In [125]:
for column in ["start_time", "stop_time"]:
    citi_bike[column] = pd.to_datetime(citi_bike[column])

In [126]:
citi_bike.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1882273 entries, 0 to 1882272
Data columns (total 2 columns):
 #   Column      Dtype
---  ------      -----
 0   start_time  datetime64[ns]
 1   stop_time   datetime64[ns]
dtypes: datetime64[ns](2)
memory usage: 28.7 MB

In [127]:
citi_bike.head()

               start_time               stop_time
0 2020-06-01 00:00:03.372 2020-06-01 00:17:46.208
1 2020-06-01 00:00:03.553 2020-06-01 01:03:33.936
2 2020-06-01 00:00:09.614 2020-06-01 00:17:06.833
3 2020-06-01 00:00:12.178 2020-06-01 00:03:58.864
4 2020-06-01 00:00:21.255 2020-06-01 00:24:18.965

In [166]:
citi_bike["start_time"].dt.day_name().value_counts()

start_time
Tuesday      305833
Sunday       301482
Monday       292690
Saturday     285966
Friday       258479
Wednesday    222647
Thursday     215176
Name: count, dtype: int64

In [129]:
citi_bike["Day of Week"] = citi_bike["start_time"].dt.dayofweek

In [130]:
citi_bike

                     start_time               stop_time  Day of Week
0       2020-06-01 00:00:03.372 2020-06-01 00:17:46.208            0
1       2020-06-01 00:00:03.553 2020-06-01 01:03:33.936            0
2       2020-06-01 00:00:09.614 2020-06-01 00:17:06.833            0
3       2020-06-01 00:00:12.178 2020-06-01 00:03:58.864            0
4       2020-06-01 00:00:21.255 2020-06-01 00:24:18.965            0
...                         ...                     ...          ...
1882268 2020-06-30 23:59:41.116 2020-07-01 00:11:06.779            1
1882269 2020-06-30 23:59:46.426 2020-07-01 00:07:13.086            1
1882270 2020-06-30 23:59:47.477 2020-07-01 00:07:06.559            1
1882271 2020-06-30 23:59:53.395 2020-07-01 00:14:43.427            1
1882272 2020-06-30 23:59:53.901 2020-07-01 00:07:07.095            1

[1882273 rows x 3 columns]

In [131]:
citi_bike.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1882273 entries, 0 to 1882272
Data columns (total 3 columns):
 #   Column       Dtype
---  ------       -----
 0   start_time   datetime64[ns]
 1   stop_time    datetime64[ns]
 2   Day of Week  int32
dtypes: datetime64[ns](2), int32(1)
memory usage: 35.9 MB

In [172]:
citi_bike["start_time"].dt.day_name().head()

0    Monday
1    Monday
2    Monday
3    Monday
4    Monday
Name: start_time, dtype: object

In [177]:
citi_bike["start_time"].dt.day_name().value_counts().nlargest(1)

start_time
Tuesday    305833
Name: count, dtype: int64

In [146]:
week_group = citi_bike.groupby(by="Day of Week")

week_group_count = week_group.count()

week_group_count

             start_time  stop_time
Day of Week
0                292690     292690
1                305833     305833
2                222647     222647
3                215176     215176
4                258479     258479
5                285966     285966
6                301482     301482

In [157]:
week_group_count.loc[1:5].nlargest(1, "start_time")

             start_time  stop_time
Day of Week
1                305833     305833

In [158]:
citi_bike

                     start_time               stop_time  Day of Week
0       2020-06-01 00:00:03.372 2020-06-01 00:17:46.208            0
1       2020-06-01 00:00:03.553 2020-06-01 01:03:33.936            0
2       2020-06-01 00:00:09.614 2020-06-01 00:17:06.833            0
3       2020-06-01 00:00:12.178 2020-06-01 00:03:58.864            0
4       2020-06-01 00:00:21.255 2020-06-01 00:24:18.965            0
...                         ...                     ...          ...
1882268 2020-06-30 23:59:41.116 2020-07-01 00:11:06.779            1
1882269 2020-06-30 23:59:46.426 2020-07-01 00:07:13.086            1
1882270 2020-06-30 23:59:47.477 2020-07-01 00:07:06.559            1
1882271 2020-06-30 23:59:53.395 2020-07-01 00:14:43.427            1
1882272 2020-06-30 23:59:53.901 2020-07-01 00:07:07.095            1

[1882273 rows x 3 columns]

In [160]:
citi_bike["duration"] = citi_bike["stop_time"] - citi_bike["start_time"]

In [161]:
citi_bike

,start_time,stop_time,Day of Week,duration
0,2020-06-01 00:00:03.372,2020-06-01 00:17:46.208,0,0 days 00:17:42.836000
1,2020-06-01 00:00:03.553,2020-06-01 01:03:33.936,0,0 days 01:03:30.383000
2,2020-06-01 00:00:09.614,2020-06-01 00:17:06.833,0,0 days 00:16:57.219000
3,2020-06-01 00:00:12.178,2020-06-01 00:03:58.864,0,0 days 00:03:46.686000
4,2020-06-01 00:00:21.255,2020-06-01 00:24:18.965,0,0 days 00:23:57.710000
...,...,...,...,...
1882268,2020-06-30 23:59:41.116,2020-07-01 00:11:06.779,1,0 days 00:11:25.663000
1882269,2020-06-30 23:59:46.426,2020-07-01 00:07:13.086,1,0 days 00:07:26.660000
1882270,2020-06-30 23:59:47.477,2020-07-01 00:07:06.559,1,0 days 00:07:19.082000
1882271,2020-06-30 23:59:53.395,2020-07-01 00:14:43.427,1,0 days 00:14:50.032000
1882272,2020-06-30 23:59:53.901,2020-07-01 00:07:07.095,1,0 days 00:07:13.194000

In [162]:
citi_bike["duration"].mean()

Timedelta('0 days 00:27:19.590506853')

In [167]:
citi_bike.nlargest(n=5, columns="duration")

,start_time,stop_time,Day of Week,duration
50593,2020-06-01 21:30:17.759,2020-07-04 12:32:12.699,0,32 days 15:01:54.940000
98339,2020-06-02 19:41:39.659,2020-07-03 21:29:00.291,1,31 days 01:47:20.632000
52306,2020-06-01 22:17:10.908,2020-07-02 17:49:31.604,0,30 days 19:32:20.696000
15171,2020-06-01 13:01:41.942,2020-07-01 17:28:30.366,0,30 days 04:26:48.424000
149761,2020-06-04 14:36:53.482,2020-07-03 00:01:44.178,3,28 days 09:24:50.696000